{
  "statedclearly": [
    {
      "title": "Stated Clearly",
      "scope": "PHP, HTML5, Responsive",
      "url": "http://statedclearly.com",
      "year": "2014",
      "desc": "",
      "testimony": "",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "",
        "logo": "",
        "img": ""
        }]
      }
    ],
  "hart-wagner": [
    {
      "title": "Hart Wagner. Trial Attorneys",
      "scope": "WordPress, Branding, Photography",
      "url": "http://hartwagner.com",
      "year": "2011",
      "desc": "The Hart Wagner firm approached us with a request to overhaul their brand image and web presence in advance of a founding partner’s retirement. A company name change demanded new branding; signage, cards, mailers, checks, and other visual assets.<br><br>Over 50 attorneys comprise Hart Wagner’s preeminent reputation in the court rooms and legal field, calling for fresh new portraits to properly represent the firm on all fronts.<br><br>Each Hart Wagner attorney has earned a marked level of experience and regard, enriching the firm’s acclaim, so we felt they deserved an appropriate display of aristocracy. We created individual attorney profiles with unique meta data for each; contacts, resume, portrait, and even more details. Building on a database infrastructure allowed us to create an expandable platform for future growth in the firm’s attorney ranks.<br><br>As technology and internet users keep a quick pace of shifting trends, it is vital to maintain modern standards in website infrastructure. The newest programming methods resolve cross-browser compatability issues, allow for more devices to access the website, and improve online data security as well. For purposes of professionalism and securing an online presence, companies must be proactive and critical of their external appearances to the online world.<br><br>HartWagner.com now meets modern standards in HTML5 and CSS3. While implementing Hart Wagner’s new visual identity, the User-Experience has also been developed for improved accessiblilty; including visual and hearing impairment.<br><br>The website is built on a dynamic CMS engine to allow frequent updates that may reflect the ongoing developments within the firm.",
      "testimony": "",
      "thumb": "bishop",
      "screens": [
        "bishop",
        "",
        ""
        ],
      "additional": [{
        "title": "Branding",
        "logo": "",
        "img": "cards"
        }]
      }
    ],
  "flexlegal": [
    {
      "title": "Flex Legal",
      "scope": "HTML5, Responsive, Branding, Photography",
      "url": "",
      "year": "2009",
      "desc": "Flex Legal is a litigation service and trial support company. We built their first website in 2009 as a flash interactive experience to help demonstrate their multi-media services, and we are now working with them again on a rebuild for accessibility from mobile and Apple devices.<br><br>Flex Legal requested our creative collaboration during their initial formation, and allowed us to design the Flex Legal brand identity and visual assets.",
      "testimony": "",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "Branding",
        "logo": "",
        "img": "cards"
        }]
      }
    ],
  "oregonruns": [
    {
      "title": "OregonRuns",
      "scope": "",
      "url": "",
      "year": "2011",
      "desc": "",
      "testimony": "",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "",
        "logo": "",
        "img": ""
        }]
      }
    ],
  "jon-mcmullen": [
    {
      "title": "Jon J. McMullen",
      "scope": "HTML5, Responsive",
      "url": "",
      "year": "2014",
      "desc": "",
      "testimony": "",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "",
        "logo": "",
        "img": ""
        }]
      }
    ],
  "lehmann": [
    {
      "title": "Lehmann Court Reporting",
      "scope": "",
      "url": "",
      "year": "2013",
      "desc": "",
      "testimony": "",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "Branding",
        "logo": "lehmann-logo",
        "img": ""
        }]
      }
    ],
  "callahan": [
    {
      "title": "Joshua V. Callahan",
      "scope": "HTML5, Responsive, Branding, Portrait",
      "url": "",
      "year": "2008",
      "desc": "",
      "testimony": "",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "Branding",
        "logo": "",
        "img": "cards"
        }]
      }
    ],
  "rayburn": [
    {
      "title": "Rayburn Law Office",
      "scope": "HTML5, Responsive, Branding, Portraits",
      "url": "",
      "year": "2011",
      "desc": "The Rayburn Law Office is a Beaverton, Oregon based firm representing individuals & families in Oregon and Southwest Washington. Our team wanted to develop a resourceful website that would be helpful to Rayburn’s clients so we worked tediously with their office to generate viable content and external resources. Of course we also worked hard to design an aesthetic, responsive, online presence that can attract new clients and help field some of the questions visitors may have.<br><br>Ralph Rayburn has been a practicing attorney since 1982, and asked us to help him rebrand his visual assets to meet modern design standards.",
      "testimony": "",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "Branding",
        "logo": "",
        "img": "cards"
        }]
      }
    ],
  "sandin": [
    {
      "title": "Sandin Insurance",
      "scope": "HTML5, Branding, Portraits",
      "url": "http://sandininsurance.com",
      "year": "2011",
      "desc": "A family owned agency, Sandin Insurance Group asked us to help them develop their brand and create a website they could use to reach new customers who want a personal partnership with their agent. We combined good clean design with a local small business feel.<br><br>The website provides resources to new and existing customers, plus a detailed online incident report form.",
      "testimony": "Working with Jeremiah was a great experience from the beginning. He has a flexible approach which fosters open communication which ensured me I would get the end result I had hoped for. In addition to that, Upheaval created unique exciting designs and photography solutions which I couldn't have envisioned on my own. After the completion of the project, he keeps the dialogue up for continued technical support I might need. - Anthony Sandin",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "Branding",
        "logo": "",
        "img": "cards"
        }]
      }
    ],
  "smartlegal": [
    {
      "title": "",
      "scope": "",
      "url": "",
      "year": "2011",
      "desc": "",
      "testimony": "",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "",
        "logo": "",
        "img": ""
        }]
      }
    ],
  "amalfis": [
    {
      "title": "",
      "scope": "PHP MVC, Admin, HTML5, Responsive",
      "url": "",
      "year": "2013",
      "desc": "",
      "testimony": "",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "",
        "logo": "",
        "img": ""
        }]
      }
    ],
  "caro-amico": [
    {
      "title": "Caro Amico Italian Cafe",
      "scope": "HTML5, Photography",
      "url": "http://caroamicoitaliancafe.com",
      "year": "2011",
      "desc": "Portland has established a foodie culture with high standards, and this historic restaurant probably laid the groundwork. Two friends fired up Portland’s first pizza diner in 1949, and the family has passed down the recipe for generations. Caro Amico Italian Cafe is locally famous, and we helped to extend their reputation to the interwebs. A complete redesign, we preserved only the cafe title from their house menus.<br><br>The chefs invited us into the kitchen to photograph preparation of enticing traditional entrées, and then served us a round of house favorite meals that we could display on the website. Even had a chance to invite our favorite models and stage a lunch with friends, wine, pizza and dessert.",
      "testimony": "",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "",
        "logo": "",
        "img": ""
        }]
      }
    ],
  "the-doors": [
    {
      "title": "The Doors, Official Band Website",
      "scope": "Flash",
      "url": "http://thedoors.com",
      "year": "2009",
      "desc": "Yes, it’s the official The Doors website. Jim Morrison’s legacy. Crazy, I know.<br><br>Working with SimpleSeason, who hold Agency of Record with Jam Inc., we took a legendary band and brought them into the 21st century fully flash and Full Screen! The entire music catalog is available for listening online, over 200 songs, fully equipped with retail links. The biggest XML/dynamic project I’ve ever created to date.<br><br>Little did I know, the band is still very popular. Generating over 10 Million dollars annually. So go out and tell your parents, The Doors are online, better than ever.",
      "testimony": "",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "",
        "logo": "",
        "img": ""
        }]
      }
    ],
  "heaven-noise": [
    {
      "title": "Heaven Noise Recordings",
      "scope": "Wordpress, Branding, Photography",
      "url": "http://heavennoise.com",
      "year": "2006",
      "desc": "NW Hip-Hop Artist IAME worked with us to develop his visual branding, album artwork, and official website. We began with the logo design and branding for his personal record label HeavenNoise Recordings which would be the home of about a dozen album releases.<br><br>IAME allowed us an open range of creativity, and we ran with that for the website design and function. Our goal was to push a media heavy online experience, including a substantial playlist of streaming MP3s, embedded videos, and new photographs.<br><br>HeavenNoise.com features a bulwark of media content, a sophisticated admin functionality, and rugged visuals! This website pushes through a crowd of indie artists, with elbows swinging hard.",
      "testimony": "Working with Upheaval has always been a great experience. My first photo shoot with Jeremiah was in 2006. I was pretty inexperienced but we still ended up getting some great pictures. Since then, I have worked with Upheaval on a variety of my projects. In 2009, Upheaval did the artwork and branding for my album I Am My Enemy: later that year they built my website heavennoise.com. The site was sleek and artistically on par with the music that I was releasing. It functioned amazingly which was great for me because I need people to be able to listen to and buy my music as easily as possible.<br><br>Recently, I wanted to revamp my website to be able to host content from a variety of artists, since I own and run a label in addition to doing my own music. Even though the first flash-built site worked great, I wanted the new site to be in HTML5 so that it would work on every device, thus being that much more accessible. I also wanted it to look and function as good as the first site, if not better. Upheaval not only met, but exceeded all of my requirements for the new site. One of the best things about working with Jeremiah and Upheaval is that they follow up and follow through. They don't just present you with a complicated website or artwork files and then leave you stranded when it's time to take the next step. As someone who stays busy, I find this to be incredibly helpful. I definitely recommend working with Upheaval. - IAME of Sandpeople/Oldominion",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "",
        "logo": "",
        "img": ""
        }]
      }
    ],
  "proof-avenue": [
    {
      "title": "Anthony Danza | Proof Avenue",
      "scope": "HTML5, Branding, Photography",
      "url": "http://proofavenue.com",
      "year": "2005",
      "desc": "A long running creative partnership only begins to sum up our affiliation with AD of Proof Avenue. While AD is banging hard to produce quality music, he looks to our team to craft the visuals. Over seven years of working together, we have single handedly designed AD’s entire catalog of albums, his identity/brand, and of course his website.",
      "testimony": "Boss of all bosses! - Anthony Danza",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "",
        "logo": "",
        "img": ""
        }]
      }
    ],
  "wapikiya": [
    {
      "title": "Wapikiya Records",
      "scope": "Flash, Photography, Album Artwork",
      "url": "http://wapikiya.upheavaltm.com",
      "year": "2010",
      "desc": "A young record label from Missoula Montana is breaking through the sound barrier, they are not quiet, they are not complacent, they are climbing out of the underground to release treble and bass, the sort not to be expected from the shadowy corners of the Northwest. Wapikiya Records is ramping up their momentum and preparing a Nation wide assault on the ears and minds of all hip-hop fans.<br><br>Wapikiya has requested our exclusive aid in a major overhaul of their online presence, and their product packaging. Beginning with a full day photoshoot here in Portland Oregon, the entire Wapikiya roster of artists clamored into our studio to capture images for the label’s next 4 album releases.<br><br>The first release is Koshir’s White Girl Diaries due to hit the streets October 5th 2010. This album will be nationally distributed by Universal Music Group, and already has a pre-order option at BestBuy.com. We are excited to see this project on shelves everywhere, which will certainly include our credit!<br><br>An out-dated existing website proved to be an ill-equipped opponent for our ruthless and ferocious flash development experience. Quickly establishing new design standards, and glamorizing the label’s presentation, our efforts were easy to bring full circle with the inclusive photography and album artwork. Check out the website and let us know what you think.",
      "testimony": "",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "",
        "logo": "",
        "img": ""
        }]
      }
    ],
  "e-40": [
    {
      "title": "E-40 | GEAR",
      "scope": "Flash, Ecommerce, Merchandising Artwork",
      "url": "http://proof.upheavaltm.com/e40gear/",
      "year": "2010",
      "desc": "E-40 (Forty Water, Forty Fonzarelli, Ambassador of the Bay, Charlie Hustle, Earl Stevens) made his rap debut in 1990, and two decades later we jumped on board to create online merchandise retail support for his latest tour. E-Feezy is an ambitious character, a clever lyricist, and a veteran in the rap game. We are simply excited to be apart of this project.<br><br>Step one: designing the actual tour merchandise with photographs provided by bay area designer PhotoDoctor graphics. 4 unique silk screen designs to be printed on tees and hoodies, even bandanas and beanies.<br><br>Step two: we created an interactive flash retail website for fans to purchase E-40 gear in advance or after his shows.",
      "testimony": "",
      "thumb": "",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "Merchandising",
        "logo": "",
        "img": ""
        }]
      }
    ]
}
