{
  "statedclearly": [
    {
      "client": "Stated Clearly",
      "title": "Stated Clearly",
      "scope": "PHP, HTML5, Responsive",
      "url": "http://statedclearly.com",
      "year": "2014",
      "desc": "",
      "testimony": "",
      "thumb": "",
      "grid": "large-6",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "",
        "logo": "",
        "img": ""
        }]
      }
    ],
    "oregonruns": [
    {
      "client": "OregonRuns",
      "title": "OregonRuns",
      "scope": "",
      "url": "",
      "year": "2011",
      "desc": "",
      "testimony": "",
      "thumb": "",
      "grid": "large-6",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "",
        "logo": "",
        "img": ""
        }]
      }
    ],
    "jon-mcmullen": [
    {
      "client": "Jon J. McMullen",
      "title": "Jon J. McMullen",
      "scope": "HTML5, Responsive",
      "url": "",
      "year": "2014",
      "desc": "",
      "testimony": "",
      "thumb": "",
      "grid": "large-4",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "",
        "logo": "",
        "img": ""
        }]
      }
    ],
  "hart-wagner": [
    {
      "client": "Hart Wagner",
      "title": "Hart Wagner. Trial Attorneys",
      "scope": "WordPress, Branding, Photography",
      "url": "http://hartwagner.com",
      "year": "2011",
      "desc": "The Hart Wagner firm approached us with a request to overhaul their brand image and web presence in advance of a founding partner’s retirement. A company name change demanded new branding; signage, cards, mailers, checks, and other visual assets.<br><br>Over 50 attorneys comprise Hart Wagner’s preeminent reputation in the court rooms and legal field, calling for fresh new portraits to properly represent the firm on all fronts.<br><br>Each Hart Wagner attorney has earned a marked level of experience and regard, enriching the firm’s acclaim, so we felt they deserved an appropriate display of aristocracy. We created individual attorney profiles with unique meta data for each; contacts, resume, portrait, and even more details. Building on a database infrastructure allowed us to create an expandable platform for future growth in the firm’s attorney ranks.<br><br>As technology and internet users keep a quick pace of shifting trends, it is vital to maintain modern standards in website infrastructure. The newest programming methods resolve cross-browser compatability issues, allow for more devices to access the website, and improve online data security as well. For purposes of professionalism and securing an online presence, companies must be proactive and critical of their external appearances to the online world.<br><br>HartWagner.com now meets modern standards in HTML5 and CSS3. While implementing Hart Wagner’s new visual identity, the User-Experience has also been developed for improved accessiblilty; including visual and hearing impairment.<br><br>The website is built on a dynamic CMS engine to allow frequent updates that may reflect the ongoing developments within the firm.",
      "testimony": "",
      "thumb": "bishop",
      "grid": "large-4",
      "screens": [
        "bishop",
        "",
        ""
        ],
      "additional": [{
        "title": "Branding",
        "logo": "",
        "img": "cards"
        }]
      }
    ],
  "flexlegal": [
    {
      "client": "Flex Legal",
      "title": "Flex Legal",
      "scope": "HTML5, Responsive, Branding, Photography",
      "url": "",
      "year": "2009",
      "desc": "Flex Legal is a litigation service and trial support company. We built their first website in 2009 as a flash interactive experience to help demonstrate their multi-media services, and we are now working with them again on a rebuild for accessibility from mobile and Apple devices.<br><br>Flex Legal requested our creative collaboration during their initial formation, and allowed us to design the Flex Legal brand identity and visual assets.",
      "testimony": "",
      "thumb": "",
      "grid": "large-4",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "Branding",
        "logo": "",
        "img": "cards"
        }]
      }
    ],
  "lehmann": [
    {
      "client": "Lehmann Court Reporting",
      "title": "Lehmann Court Reporting",
      "scope": "",
      "url": "",
      "year": "2013",
      "desc": "",
      "testimony": "",
      "thumb": "",
      "grid": "large-2",
      "screens": [
        "",
        "",
        ""
        ],
      "additional": [{
        "title": "Branding",
        "logo": "lehmann-logo",
        "img": ""
        }]
      }
    ]
}
